In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
url = "https://developers.google.com/public-data/docs/canonical/countries_csv"

In [3]:
LonLatTable = pd.read_html(url)
LonLatTable

[           0           1            2                                 3
 0    country    latitude    longitude                              name
 1         AD   42.546245     1.601554                           Andorra
 2         AE   23.424076    53.847818              United Arab Emirates
 3         AF    33.93911    67.709953                       Afghanistan
 4         AG   17.060816   -61.796428               Antigua and Barbuda
 5         AI   18.220554   -63.068615                          Anguilla
 6         AL   41.153332    20.168331                           Albania
 7         AM   40.069099    45.038189                           Armenia
 8         AN   12.226079   -69.060087              Netherlands Antilles
 9         AO  -11.202692    17.873887                            Angola
 10        AQ  -75.250973    -0.071389                        Antarctica
 11        AR  -38.416097   -63.616672                         Argentina
 12        AS  -14.270972  -170.132217                    American Samoa
 13        AT   47.516231    14.550072                           Austria
 14        AU  -25.274398   133.775136                         Australia
 15        AW    12.52111   -69.968338                             Aruba
 16        AZ   40.143105    47.576927                        Azerbaijan
 17        BA   43.915886    17.679076            Bosnia and Herzegovina
 18        BB   13.193887   -59.543198                          Barbados
 19        BD   23.684994    90.356331                        Bangladesh
 20        BE   50.503887     4.469936                           Belgium
 21        BF   12.238333    -1.561593                      Burkina Faso
 22        BG   42.733883     25.48583                          Bulgaria
 23        BH   25.930414    50.637772                           Bahrain
 24        BI   -3.373056    29.918886                           Burundi
 25        BJ     9.30769     2.315834                             Benin
 26        BM   32.321384    -64.75737                           Bermuda
 27        BN    4.535277   114.727669                            Brunei
 28        BO  -16.290154   -63.588653                           Bolivia
 29        BR  -14.235004    -51.92528                            Brazil
 ..       ...         ...          ...                               ...
 216       TL   -8.874217   125.727539                       Timor-Leste
 217       TM   38.969719    59.556278                      Turkmenistan
 218       TN   33.886917     9.537499                           Tunisia
 219       TO  -21.178986  -175.198242                             Tonga
 220       TR   38.963745    35.243322                            Turkey
 221       TT   10.691803   -61.222503               Trinidad and Tobago
 222       TV   -7.109535    177.64933                            Tuvalu
 223       TW    23.69781   120.960515                            Taiwan
 224       TZ   -6.369028    34.888822                          Tanzania
 225       UA   48.379433     31.16558                           Ukraine
 226       UG    1.373333    32.290275                            Uganda
 227       UM         NaN          NaN       U.S. Minor Outlying Islands
 228       US    37.09024   -95.712891                     United States
 229       UY  -32.522779   -55.765835                           Uruguay
 230       UZ   41.377491    64.585262                        Uzbekistan
 231       VA   41.902916    12.453389                      Vatican City
 232       VC   12.984305   -61.287228  Saint Vincent and the Grenadines
 233       VE     6.42375    -66.58973                         Venezuela
 234       VG   18.420695   -64.639968            British Virgin Islands
 235       VI   18.335765   -64.896335               U.S. Virgin Islands
 236       VN   14.058324   108.277199                           Vietnam
 237       VU  -15.376706   166.959158                           Vanuatu
 238       WF  -13.768752  -177.156097                 Wallis and Futuna
 239       WS  -13.759029  -172.104629                             Samoa
 240       XK   42.602636    20.902977                            Kosovo
 241       YE   15.552727    48.516388                             Yemen
 242       YT    -12.8275    45.166244                           Mayotte
 243       ZA  -30.559482    22.937506                      South Africa
 244       ZM  -13.133897    27.849332                            Zambia
 245       ZW  -19.015438    29.154857                          Zimbabwe

 [246 rows x 4 columns]]

In [4]:
type(LonLatTable)

list

In [5]:
df = LonLatTable[0]
df.columns = ['Abbreviation','Latitude','Longitude', 'Country']
df.head()

  Abbreviation   Latitude   Longitude               Country
0      country   latitude   longitude                  name
1           AD  42.546245    1.601554               Andorra
2           AE  23.424076   53.847818  United Arab Emirates
3           AF   33.93911   67.709953           Afghanistan
4           AG  17.060816  -61.796428   Antigua and Barbuda

In [6]:
df = df.iloc[2:]
df.head()

  Abbreviation   Latitude   Longitude               Country
2           AE  23.424076   53.847818  United Arab Emirates
3           AF   33.93911   67.709953           Afghanistan
4           AG  17.060816  -61.796428   Antigua and Barbuda
5           AI  18.220554  -63.068615              Anguilla
6           AL  41.153332   20.168331               Albania

In [7]:
df.set_index('Country', inplace=True)
df.head()

                     Abbreviation   Latitude   Longitude
Country
United Arab Emirates           AE  23.424076   53.847818
Afghanistan                    AF   33.93911   67.709953
Antigua and Barbuda            AG  17.060816  -61.796428
Anguilla                       AI  18.220554  -63.068615
Albania                        AL  41.153332   20.168331

In [ ]:
engine = create_engine("enter the team sql string here!")

In [ ]:
df=pd.DataFrame(['tables'],columns=['Country','Abbreviation','Latitude','Longitude'])
df.to_sql(name='LatLon_Table'), con=engine,if_exists='append')